#!/usr/bin/env python3
# -*- coding: utf8 -*-

# Задание-3
# Пользователь вводит положительное целое число больше 1
# Нужно создать квадратную матрицу этого размера и по спирали заполнить её числами

# 5
#  1  2  3  4 5
# 16 17 18 19 6
# 15 24 25 20 7
# 14 23 22 21 8
# 13 12 11 10 9

# 3
# 1 2 3
# 8 9 4
# 7 6 5

# -----------------------------------------------------------
def ChangeValue(smatrix, y, x, val):
    if smatrix[y][x] == 0:
        smatrix[y][x] = val
# -----------------------------------------------------------

matrix = []
n = 9 # размерность квадратной матрицы
r = 0 # количество как бы законченых квадратов
x = 0 # ячейка
y = 0 # строка
step = 1 #  шаги/повороты ... 1: с лева на право, 2: с верху в низ, 3: с права на лево, 4: с низу вверх
# -----------------------------------------------------------

for i in range(n): # создаём матрицу заполненную нулями
    smatrix = []
    for j in range(n):
        smatrix.append(0)
    matrix.append(smatrix)
#
for i in range(n**2):
    ChangeValue(matrix, y, x, i + 1)
    #
    if step == 1:
        x = x +1
        if x > n -1 -r:
            x = x -1
            step = 2
    #
    if step == 2:
        y = y +1
        if y > n -1 -r:
            y = y -1
            step = 3
    #
    if step == 3:
        x = x -1
        if x < r:
            x = r
            step = 4
    #
    if step == 4:
        y = y -1
        if y == r:
            r = r +1

            y = r
            x = r

            step = 1
#
for i in range (n):
    for j in range(n):
        print (f'{matrix[i][j]:<3}', end = '')
    print()
